
#سٽ 1 "hb-ot-shaper-myanmar-machine.rl"
/*
 * Copyright © 2011,2012  Google, Inc.
 *
 *  This is part of HarfBuzz, a text shaping library.
 *
 * Permission is hereby granted, without written agreement and without
 * license or royalty fees, to use, copy, modify, and distribute this
 * software and its documentation for any purpose, provided that the
 * above copyright notice and the following two paragraphs appear in
 * all copies of this software.
 *
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES
 * ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN
 * IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 *
 * THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING,
 * BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 * FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
 *
 * Google Author(s): Behdad Esfahbod
 */

#جيڪڏهن_وصف_نه_ٿيل HB_OT_SHAPER_MYANMAR_MACHINE_HH
#وصف_ڪريو HB_OT_SHAPER_MYANMAR_MACHINE_HH

#ضمن "hb.hh"

#ضمن "hb-ot-layout.hh"
#ضمن "hb-ot-shaper-indic.hh"

/* buffer var allocations */
#وصف_ڪريو myanmar_category() ot_shaper_var_u8_category() /* myanmar_category_t */
#وصف_ڪريو myanmar_position() ot_shaper_var_u8_auxiliary() /* myanmar_position_t */

استعمال myanmar_category_t = بنانشان;
استعمال myanmar_position_t = ot_position_t;

#وصف_ڪريو M_Cat(Cat) myanmar_syllable_machine_ex_##Cat

تعداد myanmar_syllable_type_t {
  myanmar_consonant_syllable,
  myanmar_broken_cluster,
  myanmar_non_myanmar_cluster,
};


#سٽ 51 "hb-ot-shaper-myanmar-machine.hh"
#وصف_ڪريو myanmar_syllable_machine_ex_A 9u
#وصف_ڪريو myanmar_syllable_machine_ex_As 32u
#وصف_ڪريو myanmar_syllable_machine_ex_C 1u
#وصف_ڪريو myanmar_syllable_machine_ex_CS 18u
#وصف_ڪريو myanmar_syllable_machine_ex_DB 3u
#وصف_ڪريو myanmar_syllable_machine_ex_DOTTEDCIRCLE 11u
#وصف_ڪريو myanmar_syllable_machine_ex_GB 10u
#وصف_ڪريو myanmar_syllable_machine_ex_H 4u
#وصف_ڪريو myanmar_syllable_machine_ex_IV 2u
#وصف_ڪريو myanmar_syllable_machine_ex_MH 35u
#وصف_ڪريو myanmar_syllable_machine_ex_ML 41u
#وصف_ڪريو myanmar_syllable_machine_ex_MR 36u
#وصف_ڪريو myanmar_syllable_machine_ex_MW 37u
#وصف_ڪريو myanmar_syllable_machine_ex_MY 38u
#وصف_ڪريو myanmar_syllable_machine_ex_PT 39u
#وصف_ڪريو myanmar_syllable_machine_ex_Ra 15u
#وصف_ڪريو myanmar_syllable_machine_ex_SM 8u
#وصف_ڪريو myanmar_syllable_machine_ex_SMPst 57u
#وصف_ڪريو myanmar_syllable_machine_ex_VAbv 20u
#وصف_ڪريو myanmar_syllable_machine_ex_VBlw 21u
#وصف_ڪريو myanmar_syllable_machine_ex_VPre 22u
#وصف_ڪريو myanmar_syllable_machine_ex_VPst 23u
#وصف_ڪريو myanmar_syllable_machine_ex_VS 40u
#وصف_ڪريو myanmar_syllable_machine_ex_ZWJ 6u
#وصف_ڪريو myanmar_syllable_machine_ex_ZWNJ 5u


#سٽ 77 "hb-ot-shaper-myanmar-machine.hh"
ساكن ثابت بنانشان حرف myanmar_syllable_machine_trans_ڪنجيون[] = {
	1u, 57u, 3u, 57u, 5u, 57u, 5u, 57u, 3u, 57u, 5u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 5u, 57u, 1u, 15u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 5u, 57u, 5u, 57u, 3u, 57u, 5u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 5u, 57u, 1u, 15u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 1u, 57u, 1u, 15u, 0
};

ساكن ثابت حرف myanmar_syllable_machine_ڪنجي_spans[] = {
	57, 55, 53, 53, 55, 53, 55, 55, 
	55, 55, 55, 53, 15, 55, 55, 55, 
	55, 55, 55, 55, 55, 55, 55, 55, 
	55, 53, 53, 55, 53, 55, 55, 55, 
	55, 55, 53, 15, 55, 55, 55, 55, 
	55, 55, 55, 55, 55, 55, 55, 55, 
	55, 55, 55, 57, 15
};

ساكن ثابت ننڍو myanmar_syllable_machine_اشاريو_offsets[] = {
	0, 58, 114, 168, 222, 278, 332, 388, 
	444, 500, 556, 612, 666, 682, 738, 794, 
	850, 906, 962, 1018, 1074, 1130, 1186, 1242, 
	1298, 1354, 1408, 1462, 1518, 1572, 1628, 1684, 
	1740, 1796, 1852, 1906, 1922, 1978, 2034, 2090, 
	2146, 2202, 2258, 2314, 2370, 2426, 2482, 2538, 
	2594, 2650, 2706, 2762, 2820
};

ساكن ثابت حرف _myanmar_syllable_machine_indicies[] = {
	1, 1, 2, 3, 4, 4, 0, 5, 
	6, 1, 1, 0, 0, 0, 7, 0, 
	0, 8, 0, 9, 10, 11, 12, 0, 
	0, 0, 0, 0, 0, 0, 0, 13, 
	0, 0, 14, 15, 16, 17, 18, 19, 
	20, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	21, 0, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 38, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 25, 25, 22, 26, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 31, 22, 22, 22, 
	22, 22, 22, 22, 22, 40, 22, 22, 
	22, 22, 22, 22, 37, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 26, 22, 
	25, 25, 22, 26, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 37, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 26, 22, 41, 22, 
	25, 25, 22, 26, 37, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 26, 22, 22, 22, 22, 
	22, 22, 37, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 26, 22, 25, 25, 
	22, 26, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 26, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 44, 22, 22, 22, 
	37, 22, 43, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 22, 22, 22, 22, 
	37, 22, 43, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 25, 25, 22, 26, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 1, 1, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	1, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 29, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 45, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 33, 22, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 33, 22, 22, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 46, 
	22, 22, 33, 34, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 33, 34, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 48, 48, 47, 5, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 12, 47, 47, 47, 
	47, 47, 47, 47, 47, 49, 47, 47, 
	47, 47, 47, 47, 18, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 5, 47, 
	48, 48, 50, 5, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 18, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 5, 50, 51, 47, 
	48, 48, 47, 5, 18, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 5, 47, 47, 47, 47, 
	47, 47, 18, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 5, 47, 48, 48, 
	47, 5, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 5, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 54, 47, 47, 47, 
	18, 47, 53, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 47, 47, 47, 47, 
	18, 47, 53, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 48, 48, 47, 5, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 55, 55, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	55, 47, 2, 3, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 19, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 10, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 56, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 14, 47, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 14, 47, 47, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 57, 
	47, 47, 14, 15, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 14, 15, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 3, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 58, 
	22, 22, 33, 34, 35, 36, 37, 38, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 59, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 1, 1, 2, 3, 48, 48, 
	47, 5, 6, 1, 1, 47, 47, 47, 
	1, 47, 47, 47, 47, 9, 10, 11, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 13, 47, 47, 14, 15, 16, 17, 
	18, 19, 20, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 1, 1, 60, 60, 
	60, 60, 60, 60, 60, 1, 1, 60, 
	60, 60, 1, 60, 0
};

ساكن ثابت حرف _myanmar_syllable_machine_trans_targs[] = {
	0, 1, 25, 35, 0, 26, 30, 49, 
	52, 37, 38, 39, 29, 41, 42, 44, 
	45, 46, 27, 48, 43, 26, 0, 2, 
	12, 0, 3, 7, 13, 14, 15, 6, 
	17, 18, 20, 21, 22, 4, 24, 19, 
	11, 5, 8, 9, 10, 16, 23, 0, 
	0, 34, 0, 28, 31, 32, 33, 36, 
	40, 47, 50, 51, 0
};

ساكن ثابت حرف _myanmar_syllable_machine_trans_actions[] = {
	3, 0, 0, 0, 4, 5, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 6, 7, 0, 
	0, 8, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 9, 
	10, 0, 11, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 12
};

ساكن ثابت حرف myanmar_syllable_machine_منزل_state_actions[] = {
	1, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0
};

ساكن ثابت حرف _myanmar_syllable_machine_from_state_actions[] = {
	2, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0
};

ساكن ثابت ننڍو _myanmar_syllable_machine_eof_trans[] = {
	0, 23, 23, 23, 23, 23, 23, 23, 
	23, 23, 23, 23, 23, 23, 23, 23, 
	23, 23, 23, 23, 23, 23, 23, 23, 
	23, 48, 51, 48, 48, 48, 48, 48, 
	48, 48, 48, 48, 48, 48, 48, 48, 
	48, 48, 48, 48, 48, 48, 48, 48, 
	48, 23, 23, 48, 61
};

ساكن ثابت صحيح myanmar_syllable_machine_شروعات = 0;
ساكن ثابت صحيح myanmar_syllable_machine_پهريون_final = 0;
ساكن ثابت صحيح myanmar_syllable_machine_error = -1;

ساكن ثابت صحيح myanmar_syllable_machine_en_main = 0;


#سٽ 55 "hb-ot-shaper-myanmar-machine.rl"



#سٽ 118 "hb-ot-shaper-myanmar-machine.rl"


#وصف_ڪريو مليو_syllable(syllable_type) \
  HB_STMT_شروعات { \
    إذا (0) fprintf (stderr, "syllable %u..%u %s\n", ts, te, #syllable_type); \
    لكل (بنانشان صحيح i = ts; i < te; i++) \
      info[i].syllable() = (syllable_serial << 4) | syllable_type; \
    syllable_serial++; \
    إذا (syllable_serial == 16) syllable_serial = 1; \
  } HB_STMT_پڇاڙي

مضمن فراغ
ڳوليو_syllables_myanmar (hb_بفر_t *بفر)
{
  بنانشان صحيح p, pe, eof, ts, te, act HB_اڻ_استعمال_ٿيل;
  صحيح cs;
  hb_glyph_info_t *info = بفر->info;
  
#سٽ 542 "hb-ot-shaper-myanmar-machine.hh"
	{
	cs = myanmar_syllable_machine_شروعات;
	ts = 0;
	te = 0;
	act = 0;
	}

#سٽ 138 "hb-ot-shaper-myanmar-machine.rl"


  p = 0;
  pe = eof = بفر->len;

  بنانشان صحيح syllable_serial = 1;
  
#سٽ 554 "hb-ot-shaper-myanmar-machine.hh"
	{
	صحيح _slen;
	صحيح _trans;
	ثابت بنانشان حرف *ڪنجيون_2;
	ثابت حرف *_inds;
	إذا ( p == pe )
		اذهب _test_eof;
_resume:
	بدل ( _myanmar_syllable_machine_from_state_actions[cs] ) {
	حالة 2:
#سٽ 1 "NONE"
	{ts = p;}
	اكسر;
#سٽ 566 "hb-ot-shaper-myanmar-machine.hh"
	}

	ڪنجيون_2 = myanmar_syllable_machine_trans_ڪنجيون + (cs<<1);
	_inds = _myanmar_syllable_machine_indicies + myanmar_syllable_machine_اشاريو_offsets[cs];

	_slen = myanmar_syllable_machine_ڪنجي_spans[cs];
	_trans = _inds[ _slen > 0 && ڪنجيون_2[0] <=( info[p].myanmar_category()) &&
		( info[p].myanmar_category()) <= ڪنجيون_2[1] ?
		( info[p].myanmar_category()) - ڪنجيون_2[0] : _slen ];

_eof_trans:
	cs = _myanmar_syllable_machine_trans_targs[_trans];

	إذا ( _myanmar_syllable_machine_trans_actions[_trans] == 0 )
		اذهب _again;

	بدل ( _myanmar_syllable_machine_trans_actions[_trans] ) {
	حالة 8:
#سٽ 111 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ مليو_syllable (myanmar_consonant_syllable); }}
	اكسر;
	حالة 4:
#سٽ 112 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ مليو_syllable (myanmar_non_myanmar_cluster); }}
	اكسر;
	حالة 10:
#سٽ 113 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ مليو_syllable (myanmar_broken_cluster); بفر->scratch_flags |= HB_بفر_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	اكسر;
	حالة 3:
#سٽ 114 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ مليو_syllable (myanmar_non_myanmar_cluster); }}
	اكسر;
	حالة 7:
#سٽ 111 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ مليو_syllable (myanmar_consonant_syllable); }}
	اكسر;
	حالة 9:
#سٽ 113 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ مليو_syllable (myanmar_broken_cluster); بفر->scratch_flags |= HB_بفر_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	اكسر;
	حالة 12:
#سٽ 114 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ مليو_syllable (myanmar_non_myanmar_cluster); }}
	اكسر;
	حالة 11:
#سٽ 1 "NONE"
	{	بدل( act ) {
	حالة 2:
	{{p = ((te))-1;} مليو_syllable (myanmar_non_myanmar_cluster); }
	اكسر;
	حالة 3:
	{{p = ((te))-1;} مليو_syllable (myanmar_broken_cluster); بفر->scratch_flags |= HB_بفر_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }
	اكسر;
	}
	}
	اكسر;
	حالة 6:
#سٽ 1 "NONE"
	{te = p+1;}
#سٽ 112 "hb-ot-shaper-myanmar-machine.rl"
	{act = 2;}
	اكسر;
	حالة 5:
#سٽ 1 "NONE"
	{te = p+1;}
#سٽ 113 "hb-ot-shaper-myanmar-machine.rl"
	{act = 3;}
	اكسر;
#سٽ 623 "hb-ot-shaper-myanmar-machine.hh"
	}

_again:
	بدل ( myanmar_syllable_machine_منزل_state_actions[cs] ) {
	حالة 1:
#سٽ 1 "NONE"
	{ts = 0;}
	اكسر;
#سٽ 630 "hb-ot-shaper-myanmar-machine.hh"
	}

	إذا ( ++p != pe )
		اذهب _resume;
	_test_eof: {}
	إذا ( p == eof )
	{
	إذا ( _myanmar_syllable_machine_eof_trans[cs] > 0 ) {
		_trans = _myanmar_syllable_machine_eof_trans[cs] - 1;
		اذهب _eof_trans;
	}
	}

	}

#سٽ 146 "hb-ot-shaper-myanmar-machine.rl"

}

#وصف_رد مليو_syllable

#جيڪڏهن_پورو /* HB_OT_SHAPER_MYANMAR_MACHINE_HH */
