
#పంక్తి 1 "hb-ot-shaper-use-machine.rl"
/*
 * Copyright © 2015  Mozilla Foundation.
 * Copyright © 2015  Google, Inc.
 *
 *  This is part of HarfBuzz, a text shaping library.
 *
 * Permission is hereby granted, without written agreement and without
 * license or royalty fees, to use, copy, modify, and distribute this
 * software and its documentation for any purpose, provided that the
 * above copyright notice and the following two paragraphs appear in
 * all copies of this software.
 *
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES
 * ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN
 * IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 *
 * THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING,
 * BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 * FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
 *
 * Mozilla Author(s): Jonathan Kew
 * Google Author(s): Behdad Esfahbod
 */

#నిర్వచితం_కాకపోతే HB_OT_SHAPER_USE_MACHINE_HH
#నిర్వచించు HB_OT_SHAPER_USE_MACHINE_HH

#అన్తర్భావ "hb.hh"

#అన్తర్భావ "hb-ot-shaper-syllabic.hh"

/* buffer var allocations */
#నిర్వచించు use_category() ot_shaper_var_u8_category()

#నిర్వచించు USE(Cat) use_syllable_machine_ex_##Cat

గణన use_syllable_type_t {
  use_virama_terminated_cluster,
  use_sakot_terminated_cluster,
  use_standard_cluster,
  use_సంఖ్య_joiner_terminated_cluster,
  use_numeral_cluster,
  use_చిహ్నం_cluster,
  use_hieroglyph_cluster,
  use_broken_cluster,
  use_non_cluster,
};


#పంక్తి 54 "hb-ot-shaper-use-machine.hh"
#నిర్వచించు use_syllable_machine_ex_B 1u
#నిర్వచించు use_syllable_machine_ex_CGJ 6u
#నిర్వచించు use_syllable_machine_ex_CMAbv 31u
#నిర్వచించు use_syllable_machine_ex_CMBlw 32u
#నిర్వచించు use_syllable_machine_ex_CS 43u
#నిర్వచించు use_syllable_machine_ex_FAbv 24u
#నిర్వచించు use_syllable_machine_ex_FBlw 25u
#నిర్వచించు use_syllable_machine_ex_FMAbv 45u
#నిర్వచించు use_syllable_machine_ex_FMBlw 46u
#నిర్వచించు use_syllable_machine_ex_FMPst 47u
#నిర్వచించు use_syllable_machine_ex_FPst 26u
#నిర్వచించు use_syllable_machine_ex_G 49u
#నిర్వచించు use_syllable_machine_ex_GB 5u
#నిర్వచించు use_syllable_machine_ex_H 12u
#నిర్వచించు use_syllable_machine_ex_HM 54u
#నిర్వచించు use_syllable_machine_ex_HN 13u
#నిర్వచించు use_syllable_machine_ex_HR 55u
#నిర్వచించు use_syllable_machine_ex_HVM 53u
#నిర్వచించు use_syllable_machine_ex_IS 44u
#నిర్వచించు use_syllable_machine_ex_J 50u
#నిర్వచించు use_syllable_machine_ex_MAbv 27u
#నిర్వచించు use_syllable_machine_ex_MBlw 28u
#నిర్వచించు use_syllable_machine_ex_MPre 30u
#నిర్వచించు use_syllable_machine_ex_MPst 29u
#నిర్వచించు use_syllable_machine_ex_N 4u
#నిర్వచించు use_syllable_machine_ex_O 0u
#నిర్వచించు use_syllable_machine_ex_R 18u
#నిర్వచించు use_syllable_machine_ex_RK 56u
#నిర్వచించు use_syllable_machine_ex_SB 51u
#నిర్వచించు use_syllable_machine_ex_SE 52u
#నిర్వచించు use_syllable_machine_ex_SMAbv 41u
#నిర్వచించు use_syllable_machine_ex_SMBlw 42u
#నిర్వచించు use_syllable_machine_ex_SUB 11u
#నిర్వచించు use_syllable_machine_ex_Sk 48u
#నిర్వచించు use_syllable_machine_ex_VAbv 33u
#నిర్వచించు use_syllable_machine_ex_VBlw 34u
#నిర్వచించు use_syllable_machine_ex_VMAbv 37u
#నిర్వచించు use_syllable_machine_ex_VMBlw 38u
#నిర్వచించు use_syllable_machine_ex_VMPre 23u
#నిర్వచించు use_syllable_machine_ex_VMPst 39u
#నిర్వచించు use_syllable_machine_ex_VPre 22u
#నిర్వచించు use_syllable_machine_ex_VPst 35u
#నిర్వచించు use_syllable_machine_ex_WJ 16u
#నిర్వచించు use_syllable_machine_ex_ZWNJ 14u


#పంక్తి 99 "hb-ot-shaper-use-machine.hh"
స్థిర స్థిరరాశి గుర్తులేని అక్షరం use_syllable_machine_trans_కీలకాలు[] = {
	49u, 51u, 0u, 56u, 11u, 56u, 11u, 56u, 1u, 53u, 14u, 48u, 14u, 47u, 14u, 47u, 
	14u, 47u, 14u, 46u, 14u, 46u, 14u, 14u, 14u, 48u, 14u, 48u, 14u, 48u, 1u, 14u, 
	14u, 48u, 14u, 53u, 14u, 53u, 14u, 53u, 14u, 53u, 12u, 53u, 14u, 53u, 12u, 53u, 
	12u, 53u, 12u, 53u, 11u, 56u, 1u, 14u, 1u, 48u, 14u, 42u, 14u, 42u, 11u, 56u, 
	1u, 53u, 14u, 48u, 14u, 47u, 14u, 47u, 14u, 47u, 14u, 46u, 14u, 46u, 14u, 14u, 
	14u, 48u, 14u, 48u, 14u, 48u, 1u, 14u, 14u, 48u, 14u, 53u, 14u, 53u, 14u, 53u, 
	14u, 53u, 12u, 53u, 14u, 53u, 12u, 53u, 12u, 53u, 12u, 53u, 11u, 56u, 1u, 14u, 
	1u, 14u, 1u, 48u, 14u, 14u, 13u, 14u, 4u, 14u, 11u, 56u, 11u, 56u, 1u, 53u, 
	14u, 48u, 14u, 47u, 14u, 47u, 14u, 47u, 14u, 46u, 14u, 46u, 14u, 14u, 14u, 48u, 
	14u, 48u, 14u, 48u, 1u, 14u, 14u, 48u, 14u, 53u, 14u, 53u, 14u, 53u, 14u, 53u, 
	12u, 53u, 14u, 53u, 12u, 53u, 12u, 53u, 12u, 53u, 11u, 56u, 1u, 14u, 1u, 14u, 
	1u, 48u, 14u, 14u, 11u, 56u, 1u, 53u, 14u, 48u, 14u, 47u, 14u, 47u, 14u, 47u, 
	14u, 46u, 14u, 46u, 14u, 14u, 14u, 48u, 14u, 48u, 14u, 48u, 1u, 14u, 14u, 48u, 
	14u, 53u, 14u, 53u, 14u, 53u, 14u, 53u, 12u, 53u, 14u, 53u, 12u, 53u, 12u, 53u, 
	12u, 53u, 11u, 56u, 1u, 14u, 1u, 48u, 4u, 14u, 13u, 14u, 1u, 56u, 14u, 42u, 
	14u, 42u, 1u, 5u, 14u, 55u, 14u, 51u, 14u, 52u, 14u, 54u, 11u, 56u, 0
};

స్థిర స్థిరరాశి అక్షరం use_syllable_machine_కీలకం_spans[] = {
	3, 57, 46, 46, 53, 35, 34, 34, 
	34, 33, 33, 1, 35, 35, 35, 14, 
	35, 40, 40, 40, 40, 42, 40, 42, 
	42, 42, 46, 14, 48, 29, 29, 46, 
	53, 35, 34, 34, 34, 33, 33, 1, 
	35, 35, 35, 14, 35, 40, 40, 40, 
	40, 42, 40, 42, 42, 42, 46, 14, 
	14, 48, 1, 2, 11, 46, 46, 53, 
	35, 34, 34, 34, 33, 33, 1, 35, 
	35, 35, 14, 35, 40, 40, 40, 40, 
	42, 40, 42, 42, 42, 46, 14, 14, 
	48, 1, 46, 53, 35, 34, 34, 34, 
	33, 33, 1, 35, 35, 35, 14, 35, 
	40, 40, 40, 40, 42, 40, 42, 42, 
	42, 46, 14, 48, 11, 2, 56, 29, 
	29, 5, 42, 38, 39, 41, 46
};

స్థిర స్థిరరాశి పొట్టి use_syllable_machine_సూచీ_offsets[] = {
	0, 4, 62, 109, 156, 210, 246, 281, 
	316, 351, 385, 419, 421, 457, 493, 529, 
	544, 580, 621, 662, 703, 744, 787, 828, 
	871, 914, 957, 1004, 1019, 1068, 1098, 1128, 
	1175, 1229, 1265, 1300, 1335, 1370, 1404, 1438, 
	1440, 1476, 1512, 1548, 1563, 1599, 1640, 1681, 
	1722, 1763, 1806, 1847, 1890, 1933, 1976, 2023, 
	2038, 2053, 2102, 2104, 2107, 2119, 2166, 2213, 
	2267, 2303, 2338, 2373, 2408, 2442, 2476, 2478, 
	2514, 2550, 2586, 2601, 2637, 2678, 2719, 2760, 
	2801, 2844, 2885, 2928, 2971, 3014, 3061, 3076, 
	3091, 3140, 3142, 3189, 3243, 3279, 3314, 3349, 
	3384, 3418, 3452, 3454, 3490, 3526, 3562, 3577, 
	3613, 3654, 3695, 3736, 3777, 3820, 3861, 3904, 
	3947, 3990, 4037, 4052, 4101, 4113, 4116, 4173, 
	4203, 4233, 4239, 4282, 4321, 4361, 4403
};

స్థిర స్థిరరాశి గుర్తులేని అక్షరం _use_syllable_machine_indicies[] = {
	1, 0, 2, 0, 3, 4, 5, 5, 
	6, 7, 5, 5, 5, 5, 5, 8, 
	9, 10, 11, 5, 5, 5, 12, 5, 
	5, 5, 13, 14, 15, 16, 17, 18, 
	19, 20, 21, 8, 22, 23, 24, 25, 
	5, 26, 27, 28, 5, 29, 30, 31, 
	32, 33, 34, 35, 32, 1, 5, 36, 
	5, 37, 5, 5, 38, 5, 40, 41, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 43, 44, 45, 46, 47, 48, 49, 
	50, 51, 40, 52, 53, 54, 55, 39, 
	56, 57, 58, 39, 59, 60, 39, 61, 
	62, 63, 64, 61, 39, 39, 39, 39, 
	65, 39, 39, 64, 39, 40, 41, 39, 
	42, 39, 39, 39, 39, 39, 39, 39, 
	43, 44, 45, 46, 47, 48, 49, 50, 
	51, 40, 52, 53, 54, 55, 39, 56, 
	57, 58, 39, 39, 39, 39, 61, 62, 
	63, 64, 61, 39, 39, 39, 39, 65, 
	39, 39, 64, 39, 40, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 39, 44, 45, 46, 47, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	56, 57, 58, 39, 39, 39, 39, 39, 
	62, 63, 64, 66, 39, 39, 39, 39, 
	44, 39, 42, 39, 39, 39, 39, 39, 
	39, 39, 39, 44, 45, 46, 47, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 56, 57, 58, 39, 39, 39, 39, 
	39, 62, 63, 64, 66, 39, 42, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	45, 46, 47, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 62, 63, 64, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 46, 47, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	62, 63, 64, 39, 42, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	47, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 62, 63, 64, 39, 42, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 62, 63, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 63, 39, 42, 39, 42, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 45, 
	46, 47, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 56, 57, 58, 39, 
	39, 39, 39, 39, 62, 63, 64, 66, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 45, 46, 47, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 57, 58, 39, 39, 39, 39, 39, 
	62, 63, 64, 66, 39, 42, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 45, 
	46, 47, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 58, 39, 
	39, 39, 39, 39, 62, 63, 64, 66, 
	39, 67, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 42, 39, 
	42, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 45, 46, 47, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 62, 
	63, 64, 66, 39, 42, 39, 39, 39, 
	39, 39, 39, 39, 43, 44, 45, 46, 
	47, 39, 39, 39, 39, 39, 39, 53, 
	54, 55, 39, 56, 57, 58, 39, 39, 
	39, 39, 39, 62, 63, 64, 66, 39, 
	39, 39, 39, 44, 39, 42, 39, 39, 
	39, 39, 39, 39, 39, 39, 44, 45, 
	46, 47, 39, 39, 39, 39, 39, 39, 
	53, 54, 55, 39, 56, 57, 58, 39, 
	39, 39, 39, 39, 62, 63, 64, 66, 
	39, 39, 39, 39, 44, 39, 42, 39, 
	39, 39, 39, 39, 39, 39, 39, 44, 
	45, 46, 47, 39, 39, 39, 39, 39, 
	39, 39, 54, 55, 39, 56, 57, 58, 
	39, 39, 39, 39, 39, 62, 63, 64, 
	66, 39, 39, 39, 39, 44, 39, 42, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	44, 45, 46, 47, 39, 39, 39, 39, 
	39, 39, 39, 39, 55, 39, 56, 57, 
	58, 39, 39, 39, 39, 39, 62, 63, 
	64, 66, 39, 39, 39, 39, 44, 39, 
	68, 39, 42, 39, 39, 39, 39, 39, 
	39, 39, 43, 44, 45, 46, 47, 39, 
	49, 50, 39, 39, 39, 53, 54, 55, 
	39, 56, 57, 58, 39, 39, 39, 39, 
	39, 62, 63, 64, 66, 39, 39, 39, 
	39, 44, 39, 42, 39, 39, 39, 39, 
	39, 39, 39, 39, 44, 45, 46, 47, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 56, 57, 58, 39, 39, 39, 
	39, 39, 62, 63, 64, 66, 39, 39, 
	39, 39, 44, 39, 68, 39, 42, 39, 
	39, 39, 39, 39, 39, 39, 43, 44, 
	45, 46, 47, 39, 39, 50, 39, 39, 
	39, 53, 54, 55, 39, 56, 57, 58, 
	39, 39, 39, 39, 39, 62, 63, 64, 
	66, 39, 39, 39, 39, 44, 39, 68, 
	39, 42, 39, 39, 39, 39, 39, 39, 
	39, 43, 44, 45, 46, 47, 39, 39, 
	39, 39, 39, 39, 53, 54, 55, 39, 
	56, 57, 58, 39, 39, 39, 39, 39, 
	62, 63, 64, 66, 39, 39, 39, 39, 
	44, 39, 68, 39, 42, 39, 39, 39, 
	39, 39, 39, 39, 43, 44, 45, 46, 
	47, 48, 49, 50, 39, 39, 39, 53, 
	54, 55, 39, 56, 57, 58, 39, 39, 
	39, 39, 39, 62, 63, 64, 66, 39, 
	39, 39, 39, 44, 39, 40, 41, 39, 
	42, 39, 39, 39, 39, 39, 39, 39, 
	43, 44, 45, 46, 47, 48, 49, 50, 
	51, 39, 52, 53, 54, 55, 39, 56, 
	57, 58, 39, 39, 39, 39, 61, 62, 
	63, 64, 61, 39, 39, 39, 39, 65, 
	39, 39, 64, 39, 40, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 42, 39, 40, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	42, 39, 39, 39, 39, 39, 39, 39, 
	39, 44, 45, 46, 47, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 56, 
	57, 58, 39, 39, 39, 39, 39, 62, 
	63, 64, 66, 39, 42, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 59, 
	60, 39, 42, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 39, 39, 
	39, 39, 39, 39, 39, 39, 60, 39, 
	4, 70, 69, 71, 69, 69, 69, 69, 
	69, 69, 69, 72, 73, 74, 75, 76, 
	77, 78, 79, 80, 4, 81, 82, 83, 
	84, 69, 85, 86, 87, 69, 69, 69, 
	69, 88, 89, 90, 91, 92, 69, 69, 
	69, 69, 93, 69, 69, 94, 69, 4, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 69, 73, 74, 75, 
	76, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 85, 86, 87, 69, 69, 
	69, 69, 69, 89, 90, 91, 95, 69, 
	69, 69, 69, 73, 69, 71, 69, 69, 
	69, 69, 69, 69, 69, 69, 73, 74, 
	75, 76, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 85, 86, 87, 69, 
	69, 69, 69, 69, 89, 90, 91, 95, 
	69, 71, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 74, 75, 76, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	89, 90, 91, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 75, 
	76, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 89, 90, 91, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 76, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 89, 90, 
	91, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 89, 90, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 90, 69, 71, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 74, 75, 76, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 85, 
	86, 87, 69, 69, 69, 69, 69, 89, 
	90, 91, 95, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 74, 75, 
	76, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 86, 87, 69, 69, 
	69, 69, 69, 89, 90, 91, 95, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 74, 75, 76, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 87, 69, 69, 69, 69, 69, 89, 
	90, 91, 95, 69, 97, 96, 96, 96, 
	96, 96, 96, 96, 96, 96, 96, 96, 
	96, 98, 96, 71, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 74, 75, 76, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 89, 90, 91, 95, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 72, 
	73, 74, 75, 76, 69, 69, 69, 69, 
	69, 69, 82, 83, 84, 69, 85, 86, 
	87, 69, 69, 69, 69, 69, 89, 90, 
	91, 95, 69, 69, 69, 69, 73, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 73, 74, 75, 76, 69, 69, 69, 
	69, 69, 69, 82, 83, 84, 69, 85, 
	86, 87, 69, 69, 69, 69, 69, 89, 
	90, 91, 95, 69, 69, 69, 69, 73, 
	69, 71, 69, 69, 69, 69, 69, 69, 
	69, 69, 73, 74, 75, 76, 69, 69, 
	69, 69, 69, 69, 69, 83, 84, 69, 
	85, 86, 87, 69, 69, 69, 69, 69, 
	89, 90, 91, 95, 69, 69, 69, 69, 
	73, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 73, 74, 75, 76, 69, 
	69, 69, 69, 69, 69, 69, 69, 84, 
	69, 85, 86, 87, 69, 69, 69, 69, 
	69, 89, 90, 91, 95, 69, 69, 69, 
	69, 73, 69, 99, 69, 71, 69, 69, 
	69, 69, 69, 69, 69, 72, 73, 74, 
	75, 76, 69, 78, 79, 69, 69, 69, 
	82, 83, 84, 69, 85, 86, 87, 69, 
	69, 69, 69, 69, 89, 90, 91, 95, 
	69, 69, 69, 69, 73, 69, 71, 69, 
	69, 69, 69, 69, 69, 69, 69, 73, 
	74, 75, 76, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 85, 86, 87, 
	69, 69, 69, 69, 69, 89, 90, 91, 
	95, 69, 69, 69, 69, 73, 69, 99, 
	69, 71, 69, 69, 69, 69, 69, 69, 
	69, 72, 73, 74, 75, 76, 69, 69, 
	79, 69, 69, 69, 82, 83, 84, 69, 
	85, 86, 87, 69, 69, 69, 69, 69, 
	89, 90, 91, 95, 69, 69, 69, 69, 
	73, 69, 99, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 72, 73, 74, 75, 
	76, 69, 69, 69, 69, 69, 69, 82, 
	83, 84, 69, 85, 86, 87, 69, 69, 
	69, 69, 69, 89, 90, 91, 95, 69, 
	69, 69, 69, 73, 69, 99, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 72, 
	73, 74, 75, 76, 77, 78, 79, 69, 
	69, 69, 82, 83, 84, 69, 85, 86, 
	87, 69, 69, 69, 69, 69, 89, 90, 
	91, 95, 69, 69, 69, 69, 73, 69, 
	4, 70, 69, 71, 69, 69, 69, 69, 
	69, 69, 69, 72, 73, 74, 75, 76, 
	77, 78, 79, 80, 69, 81, 82, 83, 
	84, 69, 85, 86, 87, 69, 69, 69, 
	69, 88, 89, 90, 91, 92, 69, 69, 
	69, 69, 93, 69, 69, 94, 69, 4, 
	100, 100, 100, 100, 100, 100, 100, 100, 
	100, 100, 100, 100, 101, 100, 4, 96, 
	96, 96, 96, 96, 96, 96, 96, 96, 
	96, 96, 96, 98, 96, 4, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 73, 74, 75, 76, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 85, 86, 87, 69, 69, 69, 69, 
	69, 89, 90, 91, 95, 69, 101, 100, 
	103, 104, 102, 6, 105, 105, 105, 105, 
	105, 105, 105, 105, 105, 106, 105, 107, 
	108, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 109, 110, 111, 112, 113, 114, 
	115, 116, 117, 107, 118, 119, 120, 121, 
	69, 122, 123, 124, 69, 59, 60, 69, 
	125, 126, 127, 128, 129, 69, 69, 69, 
	69, 130, 69, 69, 131, 69, 107, 108, 
	69, 71, 69, 69, 69, 69, 69, 69, 
	69, 109, 110, 111, 112, 113, 114, 115, 
	116, 117, 107, 118, 119, 120, 121, 69, 
	122, 123, 124, 69, 69, 69, 69, 125, 
	126, 127, 128, 129, 69, 69, 69, 69, 
	130, 69, 69, 131, 69, 107, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 110, 111, 112, 113, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 122, 123, 124, 69, 69, 69, 69, 
	69, 126, 127, 128, 132, 69, 69, 69, 
	69, 110, 69, 71, 69, 69, 69, 69, 
	69, 69, 69, 69, 110, 111, 112, 113, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 122, 123, 124, 69, 69, 69, 
	69, 69, 126, 127, 128, 132, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 111, 112, 113, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 126, 127, 
	128, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 112, 113, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 126, 127, 128, 69, 71, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 113, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 126, 127, 128, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 126, 
	127, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 127, 69, 71, 69, 71, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	111, 112, 113, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 122, 123, 124, 
	69, 69, 69, 69, 69, 126, 127, 128, 
	132, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 111, 112, 113, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 123, 124, 69, 69, 69, 69, 
	69, 126, 127, 128, 132, 69, 71, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	111, 112, 113, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 124, 
	69, 69, 69, 69, 69, 126, 127, 128, 
	132, 69, 133, 96, 96, 96, 96, 96, 
	96, 96, 96, 96, 96, 96, 96, 98, 
	96, 71, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 111, 112, 113, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	126, 127, 128, 132, 69, 71, 69, 69, 
	69, 69, 69, 69, 69, 109, 110, 111, 
	112, 113, 69, 69, 69, 69, 69, 69, 
	119, 120, 121, 69, 122, 123, 124, 69, 
	69, 69, 69, 69, 126, 127, 128, 132, 
	69, 69, 69, 69, 110, 69, 71, 69, 
	69, 69, 69, 69, 69, 69, 69, 110, 
	111, 112, 113, 69, 69, 69, 69, 69, 
	69, 119, 120, 121, 69, 122, 123, 124, 
	69, 69, 69, 69, 69, 126, 127, 128, 
	132, 69, 69, 69, 69, 110, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	110, 111, 112, 113, 69, 69, 69, 69, 
	69, 69, 69, 120, 121, 69, 122, 123, 
	124, 69, 69, 69, 69, 69, 126, 127, 
	128, 132, 69, 69, 69, 69, 110, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 110, 111, 112, 113, 69, 69, 69, 
	69, 69, 69, 69, 69, 121, 69, 122, 
	123, 124, 69, 69, 69, 69, 69, 126, 
	127, 128, 132, 69, 69, 69, 69, 110, 
	69, 134, 69, 71, 69, 69, 69, 69, 
	69, 69, 69, 109, 110, 111, 112, 113, 
	69, 115, 116, 69, 69, 69, 119, 120, 
	121, 69, 122, 123, 124, 69, 69, 69, 
	69, 69, 126, 127, 128, 132, 69, 69, 
	69, 69, 110, 69, 71, 69, 69, 69, 
	69, 69, 69, 69, 69, 110, 111, 112, 
	113, 69, 69, 69, 69, 69, 69, 69, 
	69, 69, 69, 122, 123, 124, 69, 69, 
	69, 69, 69, 126, 127, 128, 132, 69, 
	69, 69, 69, 110, 69, 134, 69, 71, 
	69, 69, 69, 69, 69, 69, 69, 109, 
	110, 111, 112, 113, 69, 69, 116, 69, 
	69, 69, 119, 120, 121, 69, 122, 123, 
	124, 69, 69, 69, 69, 69, 126, 127, 
	128, 132, 69, 69, 69, 69, 110, 69, 
	134, 69, 71, 69, 69, 69, 69, 69, 
	69, 69, 109, 110, 111, 112, 113, 69, 
	69, 69, 69, 69, 69, 119, 120, 121, 
	69, 122, 123, 124, 69, 69, 69, 69, 
	69, 126, 127, 128, 132, 69, 69, 69, 
	69, 110, 69, 134, 69, 71, 69, 69, 
	69, 69, 69, 69, 69, 109, 110, 111, 
	112, 113, 114, 115, 116, 69, 69, 69, 
	119, 120, 121, 69, 122, 123, 124, 69, 
	69, 69, 69, 69, 126, 127, 128, 132, 
	69, 69, 69, 69, 110, 69, 107, 108, 
	69, 71, 69, 69, 69, 69, 69, 69, 
	69, 109, 110, 111, 112, 113, 114, 115, 
	116, 117, 69, 118, 119, 120, 121, 69, 
	122, 123, 124, 69, 69, 69, 69, 125, 
	126, 127, 128, 129, 69, 69, 69, 69, 
	130, 69, 69, 131, 69, 107, 100, 100, 
	100, 100, 100, 100, 100, 100, 100, 100, 
	100, 100, 101, 100, 107, 96, 96, 96, 
	96, 96, 96, 96, 96, 96, 96, 96, 
	96, 98, 96, 107, 69, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 69, 
	71, 69, 69, 69, 69, 69, 69, 69, 
	69, 110, 111, 112, 113, 69, 69, 69, 
	69, 69, 69, 69, 69, 69, 69, 122, 
	123, 124, 69, 69, 69, 69, 69, 126, 
	127, 128, 132, 69, 101, 100, 8, 9, 
	135, 11, 135, 135, 135, 135, 135, 135, 
	135, 13, 14, 15, 16, 17, 18, 19, 
	20, 21, 8, 22, 23, 24, 25, 135, 
	26, 27, 28, 135, 135, 135, 135, 32, 
	33, 34, 38, 32, 135, 135, 135, 135, 
	37, 135, 135, 38, 135, 8, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 11, 135, 135, 135, 135, 135, 
	135, 135, 135, 14, 15, 16, 17, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 26, 27, 28, 135, 135, 135, 135, 
	135, 33, 34, 38, 136, 135, 135, 135, 
	135, 14, 135, 11, 135, 135, 135, 135, 
	135, 135, 135, 135, 14, 15, 16, 17, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 26, 27, 28, 135, 135, 135, 
	135, 135, 33, 34, 38, 136, 135, 11, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 15, 16, 17, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 33, 34, 
	38, 135, 11, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 16, 17, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 33, 34, 38, 135, 11, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 17, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 33, 34, 38, 135, 
	11, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 33, 
	34, 135, 11, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 34, 135, 11, 137, 11, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	15, 16, 17, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 26, 27, 28, 
	135, 135, 135, 135, 135, 33, 34, 38, 
	136, 135, 11, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 15, 16, 17, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 27, 28, 135, 135, 135, 135, 
	135, 33, 34, 38, 136, 135, 11, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	15, 16, 17, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 28, 
	135, 135, 135, 135, 135, 33, 34, 38, 
	136, 135, 138, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 11, 
	135, 11, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 15, 16, 17, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	33, 34, 38, 136, 135, 11, 135, 135, 
	135, 135, 135, 135, 135, 13, 14, 15, 
	16, 17, 135, 135, 135, 135, 135, 135, 
	23, 24, 25, 135, 26, 27, 28, 135, 
	135, 135, 135, 135, 33, 34, 38, 136, 
	135, 135, 135, 135, 14, 135, 11, 135, 
	135, 135, 135, 135, 135, 135, 135, 14, 
	15, 16, 17, 135, 135, 135, 135, 135, 
	135, 23, 24, 25, 135, 26, 27, 28, 
	135, 135, 135, 135, 135, 33, 34, 38, 
	136, 135, 135, 135, 135, 14, 135, 11, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	14, 15, 16, 17, 135, 135, 135, 135, 
	135, 135, 135, 24, 25, 135, 26, 27, 
	28, 135, 135, 135, 135, 135, 33, 34, 
	38, 136, 135, 135, 135, 135, 14, 135, 
	11, 135, 135, 135, 135, 135, 135, 135, 
	135, 14, 15, 16, 17, 135, 135, 135, 
	135, 135, 135, 135, 135, 25, 135, 26, 
	27, 28, 135, 135, 135, 135, 135, 33, 
	34, 38, 136, 135, 135, 135, 135, 14, 
	135, 139, 135, 11, 135, 135, 135, 135, 
	135, 135, 135, 13, 14, 15, 16, 17, 
	135, 19, 20, 135, 135, 135, 23, 24, 
	25, 135, 26, 27, 28, 135, 135, 135, 
	135, 135, 33, 34, 38, 136, 135, 135, 
	135, 135, 14, 135, 11, 135, 135, 135, 
	135, 135, 135, 135, 135, 14, 15, 16, 
	17, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 26, 27, 28, 135, 135, 
	135, 135, 135, 33, 34, 38, 136, 135, 
	135, 135, 135, 14, 135, 139, 135, 11, 
	135, 135, 135, 135, 135, 135, 135, 13, 
	14, 15, 16, 17, 135, 135, 20, 135, 
	135, 135, 23, 24, 25, 135, 26, 27, 
	28, 135, 135, 135, 135, 135, 33, 34, 
	38, 136, 135, 135, 135, 135, 14, 135, 
	139, 135, 11, 135, 135, 135, 135, 135, 
	135, 135, 13, 14, 15, 16, 17, 135, 
	135, 135, 135, 135, 135, 23, 24, 25, 
	135, 26, 27, 28, 135, 135, 135, 135, 
	135, 33, 34, 38, 136, 135, 135, 135, 
	135, 14, 135, 139, 135, 11, 135, 135, 
	135, 135, 135, 135, 135, 13, 14, 15, 
	16, 17, 18, 19, 20, 135, 135, 135, 
	23, 24, 25, 135, 26, 27, 28, 135, 
	135, 135, 135, 135, 33, 34, 38, 136, 
	135, 135, 135, 135, 14, 135, 8, 9, 
	135, 11, 135, 135, 135, 135, 135, 135, 
	135, 13, 14, 15, 16, 17, 18, 19, 
	20, 21, 135, 22, 23, 24, 25, 135, 
	26, 27, 28, 135, 135, 135, 135, 32, 
	33, 34, 38, 32, 135, 135, 135, 135, 
	37, 135, 135, 38, 135, 8, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 11, 135, 8, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 11, 135, 135, 135, 135, 135, 135, 
	135, 135, 14, 15, 16, 17, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	26, 27, 28, 135, 135, 135, 135, 135, 
	33, 34, 38, 136, 135, 140, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 11, 
	135, 10, 11, 135, 4, 135, 135, 135, 
	4, 135, 135, 135, 135, 135, 8, 9, 
	10, 11, 135, 135, 135, 135, 135, 135, 
	135, 13, 14, 15, 16, 17, 18, 19, 
	20, 21, 8, 22, 23, 24, 25, 135, 
	26, 27, 28, 135, 29, 30, 135, 32, 
	33, 34, 38, 32, 135, 135, 135, 135, 
	37, 135, 135, 38, 135, 11, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	29, 30, 135, 11, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 135, 
	135, 135, 135, 135, 135, 135, 135, 30, 
	135, 4, 141, 141, 141, 4, 141, 143, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 144, 142, 145, 142, 145, 
	146, 142, 143, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 1, 144, 144, 
	142, 143, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 144, 142, 145, 
	142, 143, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 142, 142, 142, 
	142, 142, 142, 142, 142, 144, 142, 145, 
	142, 145, 142, 40, 41, 39, 42, 39, 
	39, 39, 39, 39, 39, 39, 43, 44, 
	45, 46, 47, 48, 49, 50, 51, 40, 
	52, 53, 54, 55, 39, 56, 57, 58, 
	39, 59, 60, 39, 61, 62, 63, 64, 
	61, 1, 39, 2, 39, 65, 39, 39, 
	64, 39, 0
};

స్థిర స్థిరరాశి అక్షరం _use_syllable_machine_trans_targs[] = {
	1, 122, 0, 2, 31, 1, 59, 61, 
	90, 91, 116, 1, 118, 104, 92, 93, 
	94, 95, 108, 110, 111, 112, 113, 105, 
	106, 107, 99, 100, 101, 119, 120, 121, 
	114, 96, 97, 98, 126, 115, 98, 1, 
	3, 4, 1, 17, 5, 6, 7, 8, 
	21, 23, 24, 25, 26, 18, 19, 20, 
	12, 13, 14, 29, 30, 27, 9, 10, 
	11, 28, 15, 16, 22, 1, 32, 1, 
	45, 33, 34, 35, 36, 49, 51, 52, 
	53, 54, 46, 47, 48, 40, 41, 42, 
	55, 37, 38, 39, 56, 57, 58, 43, 
	1, 44, 1, 50, 1, 1, 1, 60, 
	1, 1, 1, 62, 63, 76, 64, 65, 
	66, 67, 80, 82, 83, 84, 85, 77, 
	78, 79, 71, 72, 73, 86, 68, 69, 
	70, 87, 88, 89, 74, 75, 81, 1, 
	102, 1, 103, 109, 117, 1, 1, 1, 
	123, 124, 125
};

స్థిర స్థిరరాశి అక్షరం _use_syllable_machine_trans_actions[] = {
	1, 0, 0, 0, 0, 4, 0, 0, 
	0, 0, 0, 5, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 6, 7, 0, 8, 9, 
	0, 0, 10, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 11, 0, 12, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	13, 0, 14, 0, 15, 16, 17, 0, 
	18, 19, 20, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 21, 
	0, 22, 0, 0, 0, 23, 24, 25, 
	0, 0, 0
};

స్థిర స్థిరరాశి అక్షరం use_syllable_machine_గమ్యం_state_actions[] = {
	0, 2, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0
};

స్థిర స్థిరరాశి అక్షరం _use_syllable_machine_from_state_actions[] = {
	0, 3, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0
};

స్థిర స్థిరరాశి పొట్టి _use_syllable_machine_eof_trans[] = {
	1, 0, 40, 40, 40, 40, 40, 40, 
	40, 40, 40, 40, 40, 40, 40, 40, 
	40, 40, 40, 40, 40, 40, 40, 40, 
	40, 40, 40, 40, 40, 40, 40, 70, 
	70, 70, 70, 70, 70, 70, 70, 70, 
	70, 70, 70, 97, 70, 70, 70, 70, 
	70, 70, 70, 70, 70, 70, 70, 101, 
	97, 70, 101, 103, 106, 70, 70, 70, 
	70, 70, 70, 70, 70, 70, 70, 70, 
	70, 70, 97, 70, 70, 70, 70, 70, 
	70, 70, 70, 70, 70, 70, 101, 97, 
	70, 101, 136, 136, 136, 136, 136, 136, 
	136, 136, 138, 136, 136, 136, 136, 136, 
	136, 136, 136, 136, 136, 136, 136, 136, 
	136, 136, 136, 136, 136, 136, 136, 136, 
	136, 142, 143, 143, 143, 143, 40
};

స్థిర స్థిరరాశి పూర్ణాంకం use_syllable_machine_ప్రారంభం = 1;
స్థిర స్థిరరాశి పూర్ణాంకం use_syllable_machine_మొదటి_final = 1;
స్థిర స్థిరరాశి పూర్ణాంకం use_syllable_machine_error = -1;

స్థిర స్థిరరాశి పూర్ణాంకం use_syllable_machine_en_main = 1;


#పంక్తి 58 "hb-ot-shaper-use-machine.rl"



#పంక్తి 186 "hb-ot-shaper-use-machine.rl"


#నిర్వచించు దొరికింది_syllable(syllable_type) \
  HB_STMT_ప్రారంభం { \
    ఒకవేళ (0) fprintf (stderr, "syllable %u..%u %s\n", (*ts).second.మొదటి, (*te).second.మొదటి, #syllable_type); \
    కొరకు (గుర్తులేని i = (*ts).second.మొదటి; i < (*te).second.మొదటి; ++i) \
      info[i].syllable() = (syllable_serial << 4) | syllable_type; \
    syllable_serial++; \
    ఒకవేళ (syllable_serial == 16) syllable_serial = 1; \
  } HB_STMT_చివర


మూస <రకం_పేరు Iter>
నిర్మాణం machine_సూచీ_t :
  hb_iter_with_fallback_t<machine_సూచీ_t<Iter>,
			  రకం_పేరు Iter::అంశం_t>
{
  machine_సూచీ_t (స్థిరరాశి Iter& it) : it (it) {}
  machine_సూచీ_t (స్థిరరాశి machine_సూచీ_t& o) : hb_iter_with_fallback_t<machine_సూచీ_t<Iter>,
								       రకం_పేరు Iter::అంశం_t> (),
					       it (o.it), is_null (o.is_null) {}

  స్థిర constexpr తార్కిక is_random_access_iterator = Iter::is_random_access_iterator;
  స్థిర constexpr తార్కిక is_sorted_iterator = Iter::is_sorted_iterator;

  రకం_పేరు Iter::అంశం_t __item__ () స్థిరరాశి { తిరిగి *it; }
  రకం_పేరు Iter::అంశం_t __item_at__ (గుర్తులేని i) స్థిరరాశి { తిరిగి it[i]; }
  గుర్తులేని __len__ () స్థిరరాశి { తిరిగి it.len (); }
  శూన్య __next__ () { ++it; }
  శూన్య __forward__ (గుర్తులేని n) { it += n; }
  శూన్య __prev__ () { --it; }
  శూన్య __rewind__ (గుర్తులేని n) { it -= n; }

  శూన్య క్రియాకారకం = (గుర్తులేని n)
  {
    ప్రతిజ్ఞా (n == 0);
    is_null = నిజం;
  }
  స్పష్టమైన క్రియాకారకం తార్కిక () { తిరిగి !is_null; }

  శూన్య క్రియాకారకం = (స్థిరరాశి machine_సూచీ_t& o)
  {
    is_null = o.is_null;
    గుర్తులేని సూచీ_2 = (*it).మొదటి;
    గుర్తులేని n = (*o.it).మొదటి;
    ఒకవేళ (సూచీ_2 < n) it += n - సూచీ_2; లేకపోతే ఒకవేళ (సూచీ_2 > n) it -= సూచీ_2 - n;
  }
  తార్కిక క్రియాకారకం == (స్థిరరాశి machine_సూచీ_t& o) స్థిరరాశి
  { తిరిగి is_null ? o.is_null : !o.is_null && (*it).మొదటి == (*o.it).మొదటి; }
  తార్కిక క్రియాకారకం != (స్థిరరాశి machine_సూచీ_t& o) స్థిరరాశి { తిరిగి !(*ఇది == o); }

  అంతరంగ:
  Iter it;
  తార్కిక is_null = అబద్ధం;
};
నిర్మాణం
{
  మూస <రకం_పేరు Iter,
	    hb_requires (hb_is_iterable (Iter))>
  machine_సూచీ_t<hb_iter_type<Iter>>
  క్రియాకారకం () (Iter&& it) స్థిరరాశి
  { తిరిగి machine_సూచీ_t<hb_iter_type<Iter>> (hb_iter (it)); }
}
HB_FUNCOBJ (machine_సూచీ);



స్థిర తార్కిక
not_ccs_default_ignorable (స్థిరరాశి hb_glyph_info_t &i)
{ తిరిగి i.use_category() != USE(CGJ); }

స్థిర అంతఃవరుస శూన్య
కనుగొను_syllables_use (hb_బఫరు_t *బఫరు)
{
  hb_glyph_info_t *info = బఫరు->info;
  స్వయంచాలక p =
    + hb_iter (info, బఫరు->len)
    | hb_enumerate
    | hb_filter ([] (స్థిరరాశి hb_glyph_info_t &i) { తిరిగి not_ccs_default_ignorable (i); },
		 hb_రెండవ)
    | hb_filter ([&] (స్థిరరాశి hb_pair_t<గుర్తులేని, స్థిరరాశి hb_glyph_info_t &> p)
		 {
		   ఒకవేళ (p.second.use_category() == USE(ZWNJ))
		     కొరకు (గుర్తులేని i = p.మొదటి + 1; i < బఫరు->len; ++i)
		       ఒకవేళ (not_ccs_default_ignorable (info[i]))
			 తిరిగి !_hb_glyph_info_is_unicode_mark (&info[i]);
		   తిరిగి నిజం;
		 })
    | hb_enumerate
    | machine_సూచీ
    ;
  స్వయంచాలక pe = p + p.len ();
  స్వయంచాలక eof = +pe;
  స్వయంచాలక ts = +p;
  స్వయంచాలక te = +p;
  గుర్తులేని పూర్ణాంకం act HB_వాడని;
  పూర్ణాంకం cs;
  
#పంక్తి 922 "hb-ot-shaper-use-machine.hh"
	{
	cs = use_syllable_machine_ప్రారంభం;
	ts = 0;
	te = 0;
	act = 0;
	}

#పంక్తి 286 "hb-ot-shaper-use-machine.rl"


  గుర్తులేని పూర్ణాంకం syllable_serial = 1;
  
#పంక్తి 931 "hb-ot-shaper-use-machine.hh"
	{
	పూర్ణాంకం _slen;
	పూర్ణాంకం _trans;
	స్థిరరాశి గుర్తులేని అక్షరం *కీలకాలు_2;
	స్థిరరాశి గుర్తులేని అక్షరం *_inds;
	ఒకవేళ ( p == pe )
		వెళ్ళు _test_eof;
_resume:
	ఎంపిక ( _use_syllable_machine_from_state_actions[cs] ) {
	స్థితి 3:
#పంక్తి 1 "NONE"
	{ts = p;}
	ఆపు;
#పంక్తి 943 "hb-ot-shaper-use-machine.hh"
	}

	కీలకాలు_2 = use_syllable_machine_trans_కీలకాలు + (cs<<1);
	_inds = _use_syllable_machine_indicies + use_syllable_machine_సూచీ_offsets[cs];

	_slen = use_syllable_machine_కీలకం_spans[cs];
	_trans = _inds[ _slen > 0 && కీలకాలు_2[0] <=( (*p).second.second.use_category()) &&
		( (*p).second.second.use_category()) <= కీలకాలు_2[1] ?
		( (*p).second.second.use_category()) - కీలకాలు_2[0] : _slen ];

_eof_trans:
	cs = _use_syllable_machine_trans_targs[_trans];

	ఒకవేళ ( _use_syllable_machine_trans_actions[_trans] == 0 )
		వెళ్ళు _again;

	ఎంపిక ( _use_syllable_machine_trans_actions[_trans] ) {
	స్థితి 7:
#పంక్తి 1 "NONE"
	{te = p+1;}
	ఆపు;
	స్థితి 16:
#పంక్తి 173 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_virama_terminated_cluster); }}
	ఆపు;
	స్థితి 14:
#పంక్తి 174 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_sakot_terminated_cluster); }}
	ఆపు;
	స్థితి 12:
#పంక్తి 175 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_standard_cluster); }}
	ఆపు;
	స్థితి 20:
#పంక్తి 176 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_సంఖ్య_joiner_terminated_cluster); }}
	ఆపు;
	స్థితి 18:
#పంక్తి 177 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_numeral_cluster); }}
	ఆపు;
	స్థితి 10:
#పంక్తి 178 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_చిహ్నం_cluster); }}
	ఆపు;
	స్థితి 25:
#పంక్తి 179 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_hieroglyph_cluster); }}
	ఆపు;
	స్థితి 5:
#పంక్తి 181 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	ఆపు;
	స్థితి 4:
#పంక్తి 182 "hb-ot-shaper-use-machine.rl"
	{te = p+1;{ దొరికింది_syllable (use_non_cluster); }}
	ఆపు;
	స్థితి 15:
#పంక్తి 173 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_virama_terminated_cluster); }}
	ఆపు;
	స్థితి 13:
#పంక్తి 174 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_sakot_terminated_cluster); }}
	ఆపు;
	స్థితి 11:
#పంక్తి 175 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_standard_cluster); }}
	ఆపు;
	స్థితి 19:
#పంక్తి 176 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_సంఖ్య_joiner_terminated_cluster); }}
	ఆపు;
	స్థితి 17:
#పంక్తి 177 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_numeral_cluster); }}
	ఆపు;
	స్థితి 9:
#పంక్తి 178 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_చిహ్నం_cluster); }}
	ఆపు;
	స్థితి 24:
#పంక్తి 179 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_hieroglyph_cluster); }}
	ఆపు;
	స్థితి 21:
#పంక్తి 181 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	ఆపు;
	స్థితి 23:
#పంక్తి 182 "hb-ot-shaper-use-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (use_non_cluster); }}
	ఆపు;
	స్థితి 1:
#పంక్తి 178 "hb-ot-shaper-use-machine.rl"
	{{p = ((te))-1;}{ దొరికింది_syllable (use_చిహ్నం_cluster); }}
	ఆపు;
	స్థితి 22:
#పంక్తి 1 "NONE"
	{	ఎంపిక( act ) {
	స్థితి 8:
	{{p = ((te))-1;} దొరికింది_syllable (use_non_cluster); }
	ఆపు;
	స్థితి 9:
	{{p = ((te))-1;} దొరికింది_syllable (use_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }
	ఆపు;
	}
	}
	ఆపు;
	స్థితి 6:
#పంక్తి 1 "NONE"
	{te = p+1;}
#పంక్తి 180 "hb-ot-shaper-use-machine.rl"
	{act = 8;}
	ఆపు;
	స్థితి 8:
#పంక్తి 1 "NONE"
	{te = p+1;}
#పంక్తి 181 "hb-ot-shaper-use-machine.rl"
	{act = 9;}
	ఆపు;
#పంక్తి 1039 "hb-ot-shaper-use-machine.hh"
	}

_again:
	ఎంపిక ( use_syllable_machine_గమ్యం_state_actions[cs] ) {
	స్థితి 2:
#పంక్తి 1 "NONE"
	{ts = 0;}
	ఆపు;
#పంక్తి 1046 "hb-ot-shaper-use-machine.hh"
	}

	ఒకవేళ ( ++p != pe )
		వెళ్ళు _resume;
	_test_eof: {}
	ఒకవేళ ( p == eof )
	{
	ఒకవేళ ( _use_syllable_machine_eof_trans[cs] > 0 ) {
		_trans = _use_syllable_machine_eof_trans[cs] - 1;
		వెళ్ళు _eof_trans;
	}
	}

	}

#పంక్తి 291 "hb-ot-shaper-use-machine.rl"

}

#నిర్వచనం_రద్దు దొరికింది_syllable

#అయితే_ముగింపు /* HB_OT_SHAPER_USE_MACHINE_HH */
