
#పంక్తి 1 "hb-ot-shaper-myanmar-machine.rl"
/*
 * Copyright © 2011,2012  Google, Inc.
 *
 *  This is part of HarfBuzz, a text shaping library.
 *
 * Permission is hereby granted, without written agreement and without
 * license or royalty fees, to use, copy, modify, and distribute this
 * software and its documentation for any purpose, provided that the
 * above copyright notice and the following two paragraphs appear in
 * all copies of this software.
 *
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES
 * ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN
 * IF THE COPYRIGHT HOLDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 *
 * THE COPYRIGHT HOLDER SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING,
 * BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 * FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE COPYRIGHT HOLDER HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
 *
 * Google Author(s): Behdad Esfahbod
 */

#నిర్వచితం_కాకపోతే HB_OT_SHAPER_MYANMAR_MACHINE_HH
#నిర్వచించు HB_OT_SHAPER_MYANMAR_MACHINE_HH

#అన్తర్భావ "hb.hh"

#అన్తర్భావ "hb-ot-layout.hh"
#అన్తర్భావ "hb-ot-shaper-indic.hh"

/* buffer var allocations */
#నిర్వచించు myanmar_category() ot_shaper_var_u8_category() /* myanmar_category_t */
#నిర్వచించు myanmar_position() ot_shaper_var_u8_auxiliary() /* myanmar_position_t */

ఉపయోగించి myanmar_category_t = గుర్తులేని;
ఉపయోగించి myanmar_position_t = ot_position_t;

#నిర్వచించు M_Cat(Cat) myanmar_syllable_machine_ex_##Cat

గణన myanmar_syllable_type_t {
  myanmar_consonant_syllable,
  myanmar_broken_cluster,
  myanmar_non_myanmar_cluster,
};


#పంక్తి 51 "hb-ot-shaper-myanmar-machine.hh"
#నిర్వచించు myanmar_syllable_machine_ex_A 9u
#నిర్వచించు myanmar_syllable_machine_ex_As 32u
#నిర్వచించు myanmar_syllable_machine_ex_C 1u
#నిర్వచించు myanmar_syllable_machine_ex_CS 18u
#నిర్వచించు myanmar_syllable_machine_ex_DB 3u
#నిర్వచించు myanmar_syllable_machine_ex_DOTTEDCIRCLE 11u
#నిర్వచించు myanmar_syllable_machine_ex_GB 10u
#నిర్వచించు myanmar_syllable_machine_ex_H 4u
#నిర్వచించు myanmar_syllable_machine_ex_IV 2u
#నిర్వచించు myanmar_syllable_machine_ex_MH 35u
#నిర్వచించు myanmar_syllable_machine_ex_ML 41u
#నిర్వచించు myanmar_syllable_machine_ex_MR 36u
#నిర్వచించు myanmar_syllable_machine_ex_MW 37u
#నిర్వచించు myanmar_syllable_machine_ex_MY 38u
#నిర్వచించు myanmar_syllable_machine_ex_PT 39u
#నిర్వచించు myanmar_syllable_machine_ex_Ra 15u
#నిర్వచించు myanmar_syllable_machine_ex_SM 8u
#నిర్వచించు myanmar_syllable_machine_ex_SMPst 57u
#నిర్వచించు myanmar_syllable_machine_ex_VAbv 20u
#నిర్వచించు myanmar_syllable_machine_ex_VBlw 21u
#నిర్వచించు myanmar_syllable_machine_ex_VPre 22u
#నిర్వచించు myanmar_syllable_machine_ex_VPst 23u
#నిర్వచించు myanmar_syllable_machine_ex_VS 40u
#నిర్వచించు myanmar_syllable_machine_ex_ZWJ 6u
#నిర్వచించు myanmar_syllable_machine_ex_ZWNJ 5u


#పంక్తి 77 "hb-ot-shaper-myanmar-machine.hh"
స్థిర స్థిరరాశి గుర్తులేని అక్షరం myanmar_syllable_machine_trans_కీలకాలు[] = {
	1u, 57u, 3u, 57u, 5u, 57u, 5u, 57u, 3u, 57u, 5u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 5u, 57u, 1u, 15u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 5u, 57u, 5u, 57u, 3u, 57u, 5u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 5u, 57u, 1u, 15u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 3u, 57u, 
	3u, 57u, 3u, 57u, 3u, 57u, 1u, 57u, 1u, 15u, 0
};

స్థిర స్థిరరాశి అక్షరం myanmar_syllable_machine_కీలకం_spans[] = {
	57, 55, 53, 53, 55, 53, 55, 55, 
	55, 55, 55, 53, 15, 55, 55, 55, 
	55, 55, 55, 55, 55, 55, 55, 55, 
	55, 53, 53, 55, 53, 55, 55, 55, 
	55, 55, 53, 15, 55, 55, 55, 55, 
	55, 55, 55, 55, 55, 55, 55, 55, 
	55, 55, 55, 57, 15
};

స్థిర స్థిరరాశి పొట్టి myanmar_syllable_machine_సూచీ_offsets[] = {
	0, 58, 114, 168, 222, 278, 332, 388, 
	444, 500, 556, 612, 666, 682, 738, 794, 
	850, 906, 962, 1018, 1074, 1130, 1186, 1242, 
	1298, 1354, 1408, 1462, 1518, 1572, 1628, 1684, 
	1740, 1796, 1852, 1906, 1922, 1978, 2034, 2090, 
	2146, 2202, 2258, 2314, 2370, 2426, 2482, 2538, 
	2594, 2650, 2706, 2762, 2820
};

స్థిర స్థిరరాశి అక్షరం _myanmar_syllable_machine_indicies[] = {
	1, 1, 2, 3, 4, 4, 0, 5, 
	6, 1, 1, 0, 0, 0, 7, 0, 
	0, 8, 0, 9, 10, 11, 12, 0, 
	0, 0, 0, 0, 0, 0, 0, 13, 
	0, 0, 14, 15, 16, 17, 18, 19, 
	20, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	21, 0, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 38, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 25, 25, 22, 26, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 31, 22, 22, 22, 
	22, 22, 22, 22, 22, 40, 22, 22, 
	22, 22, 22, 22, 37, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 26, 22, 
	25, 25, 22, 26, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 37, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 26, 22, 41, 22, 
	25, 25, 22, 26, 37, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 26, 22, 22, 22, 22, 
	22, 22, 37, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 26, 22, 25, 25, 
	22, 26, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 26, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 44, 22, 22, 22, 
	37, 22, 43, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 22, 22, 22, 22, 
	37, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 23, 22, 25, 25, 
	22, 26, 27, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 42, 22, 22, 
	31, 22, 22, 22, 22, 22, 22, 22, 
	22, 43, 22, 22, 22, 22, 22, 22, 
	37, 22, 43, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 26, 22, 25, 25, 22, 26, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 1, 1, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	1, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 29, 22, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 45, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 22, 22, 22, 22, 37, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 33, 22, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 45, 
	22, 22, 33, 22, 22, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 46, 
	22, 22, 33, 34, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 22, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 33, 34, 35, 22, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 48, 48, 47, 5, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 12, 47, 47, 47, 
	47, 47, 47, 47, 47, 49, 47, 47, 
	47, 47, 47, 47, 18, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 5, 47, 
	48, 48, 50, 5, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 18, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 50, 50, 50, 50, 
	50, 50, 50, 50, 5, 50, 51, 47, 
	48, 48, 47, 5, 18, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 5, 47, 47, 47, 47, 
	47, 47, 18, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 5, 47, 48, 48, 
	47, 5, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 5, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 54, 47, 47, 47, 
	18, 47, 53, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 47, 47, 47, 47, 
	18, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 2, 47, 48, 48, 
	47, 5, 6, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 52, 47, 47, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 53, 47, 47, 47, 47, 47, 47, 
	18, 47, 53, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 48, 48, 47, 5, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 55, 55, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	55, 47, 2, 3, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 19, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 10, 47, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 56, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 47, 47, 47, 47, 18, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 14, 47, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 56, 
	47, 47, 14, 47, 47, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 57, 
	47, 47, 14, 15, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 47, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 14, 15, 16, 47, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 2, 3, 48, 48, 47, 5, 
	6, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 9, 10, 11, 12, 47, 
	47, 47, 47, 47, 47, 47, 47, 13, 
	47, 47, 14, 15, 16, 17, 18, 47, 
	20, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	5, 47, 23, 24, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 58, 
	22, 22, 33, 34, 35, 36, 37, 38, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 23, 59, 25, 25, 22, 26, 
	27, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 28, 29, 30, 31, 22, 
	22, 22, 22, 22, 22, 22, 22, 32, 
	22, 22, 33, 34, 35, 36, 37, 22, 
	39, 22, 22, 22, 22, 22, 22, 22, 
	22, 22, 22, 22, 22, 22, 22, 22, 
	26, 22, 1, 1, 2, 3, 48, 48, 
	47, 5, 6, 1, 1, 47, 47, 47, 
	1, 47, 47, 47, 47, 9, 10, 11, 
	12, 47, 47, 47, 47, 47, 47, 47, 
	47, 13, 47, 47, 14, 15, 16, 17, 
	18, 19, 20, 47, 47, 47, 47, 47, 
	47, 47, 47, 47, 47, 47, 47, 47, 
	47, 47, 5, 47, 1, 1, 60, 60, 
	60, 60, 60, 60, 60, 1, 1, 60, 
	60, 60, 1, 60, 0
};

స్థిర స్థిరరాశి అక్షరం _myanmar_syllable_machine_trans_targs[] = {
	0, 1, 25, 35, 0, 26, 30, 49, 
	52, 37, 38, 39, 29, 41, 42, 44, 
	45, 46, 27, 48, 43, 26, 0, 2, 
	12, 0, 3, 7, 13, 14, 15, 6, 
	17, 18, 20, 21, 22, 4, 24, 19, 
	11, 5, 8, 9, 10, 16, 23, 0, 
	0, 34, 0, 28, 31, 32, 33, 36, 
	40, 47, 50, 51, 0
};

స్థిర స్థిరరాశి అక్షరం _myanmar_syllable_machine_trans_actions[] = {
	3, 0, 0, 0, 4, 5, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 6, 7, 0, 
	0, 8, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 9, 
	10, 0, 11, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 12
};

స్థిర స్థిరరాశి అక్షరం myanmar_syllable_machine_గమ్యం_state_actions[] = {
	1, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0
};

స్థిర స్థిరరాశి అక్షరం _myanmar_syllable_machine_from_state_actions[] = {
	2, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0, 0, 0, 0, 
	0, 0, 0, 0, 0
};

స్థిర స్థిరరాశి పొట్టి _myanmar_syllable_machine_eof_trans[] = {
	0, 23, 23, 23, 23, 23, 23, 23, 
	23, 23, 23, 23, 23, 23, 23, 23, 
	23, 23, 23, 23, 23, 23, 23, 23, 
	23, 48, 51, 48, 48, 48, 48, 48, 
	48, 48, 48, 48, 48, 48, 48, 48, 
	48, 48, 48, 48, 48, 48, 48, 48, 
	48, 23, 23, 48, 61
};

స్థిర స్థిరరాశి పూర్ణాంకం myanmar_syllable_machine_ప్రారంభం = 0;
స్థిర స్థిరరాశి పూర్ణాంకం myanmar_syllable_machine_మొదటి_final = 0;
స్థిర స్థిరరాశి పూర్ణాంకం myanmar_syllable_machine_error = -1;

స్థిర స్థిరరాశి పూర్ణాంకం myanmar_syllable_machine_en_main = 0;


#పంక్తి 55 "hb-ot-shaper-myanmar-machine.rl"



#పంక్తి 118 "hb-ot-shaper-myanmar-machine.rl"


#నిర్వచించు దొరికింది_syllable(syllable_type) \
  HB_STMT_ప్రారంభం { \
    ఒకవేళ (0) fprintf (stderr, "syllable %u..%u %s\n", ts, te, #syllable_type); \
    కొరకు (గుర్తులేని పూర్ణాంకం i = ts; i < te; i++) \
      info[i].syllable() = (syllable_serial << 4) | syllable_type; \
    syllable_serial++; \
    ఒకవేళ (syllable_serial == 16) syllable_serial = 1; \
  } HB_STMT_చివర

అంతఃవరుస శూన్య
కనుగొను_syllables_myanmar (hb_బఫరు_t *బఫరు)
{
  గుర్తులేని పూర్ణాంకం p, pe, eof, ts, te, act HB_వాడని;
  పూర్ణాంకం cs;
  hb_glyph_info_t *info = బఫరు->info;
  
#పంక్తి 542 "hb-ot-shaper-myanmar-machine.hh"
	{
	cs = myanmar_syllable_machine_ప్రారంభం;
	ts = 0;
	te = 0;
	act = 0;
	}

#పంక్తి 138 "hb-ot-shaper-myanmar-machine.rl"


  p = 0;
  pe = eof = బఫరు->len;

  గుర్తులేని పూర్ణాంకం syllable_serial = 1;
  
#పంక్తి 554 "hb-ot-shaper-myanmar-machine.hh"
	{
	పూర్ణాంకం _slen;
	పూర్ణాంకం _trans;
	స్థిరరాశి గుర్తులేని అక్షరం *కీలకాలు_2;
	స్థిరరాశి అక్షరం *_inds;
	ఒకవేళ ( p == pe )
		వెళ్ళు _test_eof;
_resume:
	ఎంపిక ( _myanmar_syllable_machine_from_state_actions[cs] ) {
	స్థితి 2:
#పంక్తి 1 "NONE"
	{ts = p;}
	ఆపు;
#పంక్తి 566 "hb-ot-shaper-myanmar-machine.hh"
	}

	కీలకాలు_2 = myanmar_syllable_machine_trans_కీలకాలు + (cs<<1);
	_inds = _myanmar_syllable_machine_indicies + myanmar_syllable_machine_సూచీ_offsets[cs];

	_slen = myanmar_syllable_machine_కీలకం_spans[cs];
	_trans = _inds[ _slen > 0 && కీలకాలు_2[0] <=( info[p].myanmar_category()) &&
		( info[p].myanmar_category()) <= కీలకాలు_2[1] ?
		( info[p].myanmar_category()) - కీలకాలు_2[0] : _slen ];

_eof_trans:
	cs = _myanmar_syllable_machine_trans_targs[_trans];

	ఒకవేళ ( _myanmar_syllable_machine_trans_actions[_trans] == 0 )
		వెళ్ళు _again;

	ఎంపిక ( _myanmar_syllable_machine_trans_actions[_trans] ) {
	స్థితి 8:
#పంక్తి 111 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ దొరికింది_syllable (myanmar_consonant_syllable); }}
	ఆపు;
	స్థితి 4:
#పంక్తి 112 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ దొరికింది_syllable (myanmar_non_myanmar_cluster); }}
	ఆపు;
	స్థితి 10:
#పంక్తి 113 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ దొరికింది_syllable (myanmar_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	ఆపు;
	స్థితి 3:
#పంక్తి 114 "hb-ot-shaper-myanmar-machine.rl"
	{te = p+1;{ దొరికింది_syllable (myanmar_non_myanmar_cluster); }}
	ఆపు;
	స్థితి 7:
#పంక్తి 111 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (myanmar_consonant_syllable); }}
	ఆపు;
	స్థితి 9:
#పంక్తి 113 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (myanmar_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }}
	ఆపు;
	స్థితి 12:
#పంక్తి 114 "hb-ot-shaper-myanmar-machine.rl"
	{te = p;p--;{ దొరికింది_syllable (myanmar_non_myanmar_cluster); }}
	ఆపు;
	స్థితి 11:
#పంక్తి 1 "NONE"
	{	ఎంపిక( act ) {
	స్థితి 2:
	{{p = ((te))-1;} దొరికింది_syllable (myanmar_non_myanmar_cluster); }
	ఆపు;
	స్థితి 3:
	{{p = ((te))-1;} దొరికింది_syllable (myanmar_broken_cluster); బఫరు->scratch_flags |= HB_బఫరు_SCRATCH_FLAG_HAS_BROKEN_SYLLABLE; }
	ఆపు;
	}
	}
	ఆపు;
	స్థితి 6:
#పంక్తి 1 "NONE"
	{te = p+1;}
#పంక్తి 112 "hb-ot-shaper-myanmar-machine.rl"
	{act = 2;}
	ఆపు;
	స్థితి 5:
#పంక్తి 1 "NONE"
	{te = p+1;}
#పంక్తి 113 "hb-ot-shaper-myanmar-machine.rl"
	{act = 3;}
	ఆపు;
#పంక్తి 623 "hb-ot-shaper-myanmar-machine.hh"
	}

_again:
	ఎంపిక ( myanmar_syllable_machine_గమ్యం_state_actions[cs] ) {
	స్థితి 1:
#పంక్తి 1 "NONE"
	{ts = 0;}
	ఆపు;
#పంక్తి 630 "hb-ot-shaper-myanmar-machine.hh"
	}

	ఒకవేళ ( ++p != pe )
		వెళ్ళు _resume;
	_test_eof: {}
	ఒకవేళ ( p == eof )
	{
	ఒకవేళ ( _myanmar_syllable_machine_eof_trans[cs] > 0 ) {
		_trans = _myanmar_syllable_machine_eof_trans[cs] - 1;
		వెళ్ళు _eof_trans;
	}
	}

	}

#పంక్తి 146 "hb-ot-shaper-myanmar-machine.rl"

}

#నిర్వచనం_రద్దు దొరికింది_syllable

#అయితే_ముగింపు /* HB_OT_SHAPER_MYANMAR_MACHINE_HH */
