#నిర్వచితం_కాకపోతే HB_ZLIB_HH
#నిర్వచించు HB_ZLIB_HH

#అన్తర్భావ "hb-blob.hh"

స్థిర అంతఃవరుస తార్కిక
hb_blob_is_gzip (స్థిరరాశి అక్షరం *దత్తాంశం,
                 గుర్తులేని    దత్తాంశం_len)
{
  తిరిగి దత్తాంశం_len >= 3 &&
         (గుర్తులేని అక్షరం) దత్తాంశం[0] == 0x1Fu &&
         (గుర్తులేని అక్షరం) దత్తాంశం[1] == 0x8Bu &&
         (గుర్తులేని అక్షరం) దత్తాంశం[2] == 0x08u;
}

స్థిర అంతఃవరుస తార్కిక
hb_gzip_get_uncompressed_కొలత (స్థిరరాశి అక్షరం *దత్తాంశం,
                               గుర్తులేని    దత్తాంశం_len,
                               uint32_t   *కొలత)
{
  ఒకవేళ (దత్తాంశం_len < 4)
    తిరిగి అబద్ధం;

  స్థిరరాశి గుర్తులేని అక్షరం *trailer = (స్థిరరాశి గుర్తులేని అక్షరం *) దత్తాంశం + దత్తాంశం_len - 4;
  ఒకవేళ (కొలత)
    *కొలత = (uint32_t) trailer[0] |
            ((uint32_t) trailer[1] << 8) |
            ((uint32_t) trailer[2] << 16) |
            ((uint32_t) trailer[3] << 24);
  తిరిగి నిజం;
}

HB_అంతర్గత hb_blob_t *
hb_blob_decompress_gzip (hb_blob_t *blob,
                         గుర్తులేని   max_output_len);

#అయితే_ముగింపు /* HB_ZLIB_HH */
