#ਜੇ_ਅਪਰਿਭਾਸ਼ਿਤ HB_ZLIB_HH
#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ HB_ZLIB_HH

#ਅਨ੍ਤਰ੍ਭਾਵ "hb-blob.hh"

ਸਥਿਰ ਸਤਰਅੰਦਰ ਤਾਰਕਿਕ
hb_blob_is_gzip (ਅਚਲ ਅੱਖਰ *ਅੰਕੜੇ,
                 ਬਿਨਾਨਿਸ਼ਾਨੀ    ਅੰਕੜੇ_len)
{
  ਵਾਪਸ ਅੰਕੜੇ_len >= 3 &&
         (ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ) ਅੰਕੜੇ[0] == 0x1Fu &&
         (ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ) ਅੰਕੜੇ[1] == 0x8Bu &&
         (ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ) ਅੰਕੜੇ[2] == 0x08u;
}

ਸਥਿਰ ਸਤਰਅੰਦਰ ਤਾਰਕਿਕ
hb_gzip_get_uncompressed_ਮਾਪ (ਅਚਲ ਅੱਖਰ *ਅੰਕੜੇ,
                               ਬਿਨਾਨਿਸ਼ਾਨੀ    ਅੰਕੜੇ_len,
                               uint32_t   *ਮਾਪ)
{
  ਜੇ (ਅੰਕੜੇ_len < 4)
    ਵਾਪਸ ਝੂਠ;

  ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *trailer = (ਅਚਲ ਬਿਨਾਨਿਸ਼ਾਨੀ ਅੱਖਰ *) ਅੰਕੜੇ + ਅੰਕੜੇ_len - 4;
  ਜੇ (ਮਾਪ)
    *ਮਾਪ = (uint32_t) trailer[0] |
            ((uint32_t) trailer[1] << 8) |
            ((uint32_t) trailer[2] << 16) |
            ((uint32_t) trailer[3] << 24);
  ਵਾਪਸ ਸੱਚ;
}

HB_ਅੰਦਰੂਨੀ hb_blob_t *
hb_blob_decompress_gzip (hb_blob_t *blob,
                         ਬਿਨਾਨਿਸ਼ਾਨੀ   max_output_len);

#ਜੇ_ਅੰਤ /* HB_ZLIB_HH */
